/**
 * @                       .::::.
 * @                     .::::::::.
 * @                    :::::::::::
 * @                 ..:::::::::::'
 * @              '::::::::::::'
 * @                .::::::::::
 * @           '::::::::::::::..
 * @                ..::::::::::::.
 * @              ``::::::::::::::::
 * @               ::::``:::::::::'        .:::.
 * @              ::::'   ':::::'       .::::::::.
 * @            .::::'      ::::     .:::::::'::::.
 * @           .:::'       :::::  .:::::::::' ':::::.
 * @          .::'        :::::.:::::::::'      ':::::.
 * @         .::'         ::::::::::::::'         ``::::.
 * @     ...:::           ::::::::::::'              ``::.
 * @    ````':.          ':::::::::'                  ::::..
 * @                       '.:::::'                    ':'````..
 * @
 * @Author       : LiWenhui liwenhuiyx@yeah.net
 * @LastEditors  : Please set LastEditors
 * @Description  :  
 * @FilePath     : /C51/C51_Project/INT0.h
 * @Version      : 0.0.1
 * @LastEditTime : 2024-05-01 22:18:28
 * @Copyright    : GuiZhouUniversity
**/



/**
 * @                       .::::.
 * @                     .::::::::.
 * @                    :::::::::::
 * @                 ..:::::::::::'
 * @              '::::::::::::'
 * @                .::::::::::
 * @           '::::::::::::::..
 * @                ..::::::::::::.
 * @              ``::::::::::::::::
 * @               ::::``:::::::::'        .:::.
 * @              ::::'   ':::::'       .::::::::.
 * @            .::::'      ::::     .:::::::'::::.
 * @           .:::'       :::::  .:::::::::' ':::::.
 * @          .::'        :::::.:::::::::'      ':::::.
 * @         .::'         ::::::::::::::'         ``::::.
 * @     ...:::           ::::::::::::'              ``::.
 * @    ````':.          ':::::::::'                  ::::..
 * @                       '.:::::'                    ':'````..
 * @
 * @Author       : LiWenhui liwenhuiyx@yeah.net
 * @LastEditors  : Please set LastEditors
 * @Description  :  
 * @FilePath     : /C51/Head/INT0.h
 * @Version      : 0.0.1
 * @LastEditTime : 2024-04-29 20:56:28
 * @Copyright    : GuiZhouUniversity
**/


#ifndef __INT0_H__
#define __INT0_H__
//用户调用函数名：
void INT0_Init(void);
#endif



#include <stc12.h>
// @brief  初始化外部中断0
// @param  无
// @retval 无
// 函数体：设置外部中断0的相关配置，并将优先级设置为1
void INT0_Init(void)//优先级为1
{
    IT0 = 1;    // 设置外部中断0触发方式为下降沿
    IE0 = 0;    // 外部中断0标志位清零
    EX0 = 1;    // 使能外部中断0
    EA = 1;     // 全局中断使能
    PX0 = 1;    // 设置外部中断0的优先级为1
}

// void Int_Routine(void) __interrupt 0
// {
//     Number++;
// }